Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཁྱོད་སྐུ་མཚན་བྲིས་རྣམ་དག་ཀྱང་། །ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དམ་པ་ཡིས། །སེམས་ཅན་བསམ་པའི་དབང་ཚུལ་དུ། །ཁྱོད་ནི་ལྷ་མོའི་སྐུ་གཟུགས་ས་སྟོན། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས།
en: {9} “Your body is beautified by the signs of a great being, But through the pure, perfectly good conduct, You manifest in the world the form of a goddess In accordance with the dispositions of beings.”

source: མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བ་ལ་ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་མངོན་པར་བསྟོད་དེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་མོ་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་ནས་ཇི་སྲིད་ཅིག་ལགས།
en: {10} Having praised the night goddess Pramudita­nayana­jagad­virocanā with those verses, Sudhana asked, “Goddess, how long has it been since you entered into attaining the highest, complete enlightenment?

source: ལྷ་མོ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཀུན་ཏུ་བཟང་པོའི་དགའ་བ་ཤིན་ཏུ་ཡངས་ཤིང་དྲི་མ་མེད་པའི་ཤུགས་ཀྱི་རྒྱལ་མཚན་འདི་ཐོབ་ནས་ཇི་སྲིད་ཅིག་ལགས། དེ་ནས་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བས།
en: Goddess, how long has it been since you attained the bodhisattva liberation called the banner of the power of vast, stainless, completely good joy?”

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། དྲན་པ་བསྐལ་པ་མང་འདས་པ། །ཞིང་གི་རྡུལ་སྙེད་དེ་ཡི་སྔ་རོལ་ན། །ཞིང་ནི་རིན་ཆེན་མདོག་བདེ་འབྱུང་། །དེ་ཡི་བསྐལ་པ་ཞི་བའི་དབྱངས་ཤེས་བྱ། །
en: The night goddess Pramudita­nayana­jagad­virocanā recited these verses to Sudhana, the head merchant’s son: “I remember, in the past, as many kalpas ago As there are atoms in a realm, There was the realm Maṇi­prabha­sukhābha In a kalpa called Praśantaghoṣa.

source: གླིང་བཞི་བྱེ་བ་ཁྲག་ཁྲིག་སྟེ། །བརྒྱ་སྟོང་ཕྲག་བཅུ་རྣམས་ཀྱིས་ཡོངས་སུ་གང་། །
en: {11} “It was filled with ten thousand quintillion Four-continent world realms.

source: ཚད་མེད་རིན་ཆེན་རི་བོ་འདྲ། །གླིང་བཞི་བར་མ་བཟང་པོ་རྣམ་པར་བཀྲམ།
en: The central four-continent world, beautifully formed, Resembled a measureless mountain of jewels.

source: ས། རྒྱལ་པོའི་ཕོ་བྲང་བྱེ་བ་བརྒྱ། །སྟོང་ཕྲག་བཅུ་རྣམས་ཡོངས་སུ་ཚང་བ་སྟེ། །
en: {12} “It was filled by the king’s cities Numbering ten thousand quintillion.

source: རྒྱལ་པོའི་ཕོ་བྲང་མདངས་དགའ་བ། །
en: The beautiful central royal city, Gandhadhvajā, shone with jewels.

source: དབུས་ན་གནས་པ་སྤོས་ཀྱི་རྒྱལ་མཚན་འོད། །དེར་ནི་ཕྱོགས་ཀྱི་དབང་པོ་ས་ཡི་བདག །འཁོར་ལོས་སྒྱུར་བ་མངོན་པར་གཟུགས་བཟང་བྱུང་། །
en: {13} “There a lord of the directions, sovereign of the land, A cakravartin with a handsome body, appeared.

source: མཚན་རབ་སུམ་ཅུ་གཉིས་དང་ལྡན། །དེ་ཡི་ལུས་ཀྱང་དཔེ་བྱད་བཟང་པོས་བརྒྱན། །
en: He had the thirty-two signs of a great being, And the features of a great being also adorned his body.

source: པད་མོའི་སྦུབས་ནས་རྫུས་ཏེ་བྱུང་། །
en: {14} “He was miraculously born from inside a lotus.

source: གསེར་གྱི་མདོག་བཟང་འོད་བྱུང་ལུས་དང་ལྡན། །
en: His body was golden and shone with light.

source: འཛམ་བུའི་རྒྱལ་མཚན་ཐམས་ཅད་དུ། །མཁའ་ལས་འགྲོ་ཞིང་འོད་ཀྱིས་དེ་འགེངས་སོ། །
en: He moved through the sky and filled with light The entirety of Jambudhvaja.

source: དེ་ཡི་བུ་ནི་སྟོང་ཚང་སྟེ། །ཀུན་ཀྱང་ཡན་ལག་དམ་པའི་གཟུགས་དང་ལྡན། །
en: {15} “He had a full thousand sons, All of whom had bodies with excellent limbs.

source: བློན་པོ་མཁས་ཤིང་གསལ་བ་དང་། །མཛངས་ཤིང་ཡིད་གཞུངས་བྱེ་བ་ཤིན་ཏུ་མང་། །
en: He had many millions of ministers Who were wise, intelligent, learned, and honest.

source: བཙུན་མོ་བྱ་བ་ཕྲག་བཅུ་ཚང་། །ལྷ་མོ་ཇི་བཞིན་དགའ་བའི་ཚུལ་ལ་མཁས། །དེ་དག་ཕན་སེམས་བདེ་སེམས་ཀྱིས། །རྒྱལ་པོ་དེ་ལ་ཉེ་བའི་ཡིད་དུ་གནས། །
en: {16} “He had a full hundred million queens Who resembled apsarases, were skilled in the art of pleasure, And with loving minds, caring minds, Affectionately attended that king.

source: རྒྱལ་པོ་དེ་ནི་ས་ཆེན་དེ། །རི་དང་ཁོར་ཡུག་ཀུན་གྱི་མཐས་ཀླས་པའི། །གླིང་བཞིའི་ཕུན་སུམ་ཚོགས་པ་དག །ཀུན་ཀྱང་ཆོས་ཀྱི་སྟོབས་ཀྱིས་གནས་པར་བྱེད། །
en: {17} “That king, through the power of the Dharma, Caused that great land, the entirety of the four continents As far as the Cakravāla mountain range, To remain in a state of good fortune.

source: ཁོ་མོ་འཁོར་ལོས་སྒྱུར་བ་ཡི། །
en: {18} “I was that cakravartin’s principal queen.

source: བཙུན་མོ་ཚངས་པའི་སྒྲ་སྐད་རིན་ཆེན་ལུས། །གསེར་གྱི་མདོག་འཆང་དྲི་མེད་འོད། །དཔག་ཚད་སྟོང་དུ་འོད་ཀྱིས་རྒྱས་པར་འགེངས། །
en: I had the voice of Brahmā and a bejeweled body, With a bright halo the color of gold That illuminated for a thousand yojanas.

source: ཉི་མ་ནུབ་པར་གྱུར་ནས་ཀྱང་། རྒྱལ་པོ་སྲས་དང་འཁོར་བཅས་གཟིམས་གྱུར་ནས། །རོལ་མོའི་དབྱངས་ཀྱང་ཞི་གྱུར་ཏེ། །ཁོ་མོ་མལ་ན་བདེ་བར་ཉལ་ཉལ་ན། །
en: {19} “After the sun had set And the king and his sons were asleep And the sound of music had ceased, I slept comfortably on my bed.

source: ནམ་གྱི་ཕྱེད་ཙམ་གུང་ཞིག་ལ། །སངས་རྒྱས་དཔལ་གྱི་རྒྱ་མཚོ་བྱུང་བར་གྱུར། །
en: {20} “In the middle of the night, The Buddha Śrisamudra appeared.

source: དེ་ཚེ་རྒྱལ་བས་རྣམ་འཕྲུལ་བ། །ཕྱོགས་བཅུ་རྒྱས་པར་བཀང་སྟེ་བསྟན་པ་མཛད། །
en: The Jina manifested limitless miracles That spread throughout the ten directions.

source: རྒྱལ་བའི་འོད་ཟེར་རྒྱ་མཚོ་དེས། །ཞིང་གི་རྡུལ་སྙེད་འཇིག་རྟེན་ཁྱབ་པར་གྱུར། །
en: {21} “That ocean of the Jina’s light Spread through worlds as numerous a realm’s atoms.

source: རྣམ་འཕྲུལ་སྐུ་རྣམས་སྣ་ཚོགས་ཀྱིས། །ཕྱོགས་བཅུ་ཐམས་ཅད་མ་ལུས་རྒྱས་པར་བཀང་། །
en: Various kinds of emanated bodies Filled all ten directions without exception.

source: ས་རྣམས་རི་དང་བཅས་པར་གཡོས། །རྒྱལ་བ་བྱུང་ཞེས་སྒྲ་ཡང་ཡོངས་སུ་བརྗོད། །
en: {22} “The earth and its mountains shook, And a voice proclaimed, ‘A jina has come!’

source: ལྷ་དང་ལྷ་མིན་མི་དང་ཀླུ། །ཀུན་ཀྱང་རྒྱལ་བ་བྱུང་བས་རབ་ཏུ་དགའ། །
en: Devas, asuras, humans, and nāgas Were all delighted that a buddha had appeared.

source: སངས་རྒྱས་བ་སྤུའི་སྒོ་ཀུན་ནས། །སྤྲུལ་པའི་རྒྱ་མཚོ་མང་པོ་མངོན་པར་བྱུང་། །
en: {23} “Many oceans of emanations appeared From all the pores of the Buddha.

source: དེས་ནི་ཕྱོགས་བཅུ་རྒྱས་བཀང་ནས། །འཇིག་རྟེན་བསམ་པ་བཞིན་དུ་ཆོས་ཀྱང་བསྟན། །
en: They spread throughout the ten directions And taught the Dharma in accordance with the aspirations of beings.

source: རྣམ་འཕྲུལ་མཐའ་ཡས་དེ་དག་ཀྱང་། །རྒྱལ་བས་ཐམས་ཅད་བདག་གི་རྨི་ལམ་བསྟན། །
en: {24} “The Jina revealed to me in a dream All those limitless miraculous manifestations.

source: ཟབ་མོའི་འབྲུག་སྒྲ་ཐོས་གྱུར་ནས། །ཁོང་དུ་ཆུད་པས་ཁོ་མོ་དགའ་ཡིད་གྱུར། །
en: When I heard the profound thunderous sound, I understood its meaning and was delighted.

source: མཚན་མོའི་ལྷ་མོ་སྟོང་སྟེང་ཀྱང་། །ཁོ་མོའི་སྟེང་གི་བར་སྣང་མཁར་གནས་ཤིང་། །རྒྱལ་བའི་ལེགས་པ་བརྗོད་བྱས་ནས། །ཁོ་མོ་སད་པར་སྨྲ་ཞིང་བརྗོད། །
en: {25} “Ten thousand night goddesses Residing in the sky above me Spoke to me, waking me from sleep, Praising the excellence of the Jina.

source: ལྷ་ཡི་བློ་གྲོས་བཙུན་མོ་ལོངས། །ཁྱོད་ཀྱི་རྒྱལ་པོའི་ཁམས་སུ་རྒྱལ་བ་སྐྱེས། །
en: {26} “ ‘Arise, wise queen of His Majesty, A jina has appeared in your kingdom.

source: བསྐལ་པ་རྒྱ་མཚོ་བརྒྱ་དག་ཏུ། །
en: This kind of good fortune is difficult to find Even in a hundred oceans of kalpas.’

source: དེ་འདྲའི་ཕུན་སུམ་ཚོགས་པ་རྣམ་དག་ཀུན། །ཁོ་མོ་དགར་གྱུར་སད་པར་གྱུར། །འོད་གསལ་དྲི་མེད་རྣམ་དག་མཐོང་། །
en: {27} “I awoke with happiness And saw the clear, pure light.

source: འོད་བཟང་དེ་ནི་ག་ལས་བལྟ་བལྟ་ན། །བྱང་ཆུབ་ཤིང་རྒྱལ་དྲུང་གི་རྒྱལ་བ་མཐོང་། །
en: I looked to see where this good light came from And saw the Jina at the foot of the Bodhi tree.

source: མཚན་ཉིད་སུམ་ཅུ་གཉིས་ཀྱིས་བརྒྱན། །བ་སྤུ་ཀུན་ནས་འོད་ཟེར་རྒྱ་མཚོ་བཀྱེ། །
en: {28} “He was adorned by the thirty-two signs of a great being, And an ocean of light rays shone from all his pores.

source: རི་རབ་ཇི་བཞིན་མངོན་པར་འཕགས། །རྒྱལ་བ་གཡས་གཡོས་ཀུན་ཏུའང་དེ་བཞིན་ནོ། །
en: Just like Sumeru he was above all, And the Jina was the same on the right and the left.

source: མཐོང་ནས་ཁོ་མོ་རབ་དགའ་སྟེ། །དེ་འདྲར་འགྱུར་བར་སེམས་ཀྱང་ཡོངས་སུ་བསྐྱེད། །
en: {29} “When I saw him I was overjoyed, And in my mind rose the aspiration to be like him.

source: སངས་རྒྱས་རྣམ་འཕྲུལ་ཡངས་མཐོང་ནས། །ཁོ་མོས་སྨོན་ལམ་ཤིན་ཏུ་རྒྱ་ཆེན་བཏབ། །
en: Having seen the manifestations of the Buddha, I made a very vast prayer.

source: ཁོ་མོས་རྒྱལ་པོ་བཞེངས་སུ་གསོལ། །དེ་ཡི་འཁོར་དང་བུད་མེད་ཚོགས་ཀྱང་བསླང་། །
en: {30} “I requested the king to arise, And his court and his wives also got up.

source: སངས་རྒྱས་འོད་ཡངས་མཐོང་གྱུར་ནས། །ཀུན་ཀྱང་བདེ་བའི་ལུས་སུ་གྱུར། །
en: When they saw the vast light from the Buddha, They all experienced physical pleasure.

source: རྒྱལ་པོ་དེ་དང་ལྷན་ཅིག་ཏུ། །བཞོན་པ་བྱེ་བ་སྲོག་ཆགས་ཁྲག་ཁྲིག་གིས། །ཡོངས་སུ་བསྐོར་ཏེ་དཔུང་བཅས་པ། །
en: {31} “I proceeded to the presence of the Jina Together with the king and his armed forces And accompanied by ten million carriages And many quintillions of beings.

source: རྒྱལ་བའི་སྤྱན་སྔར་ཀུན་ཀྱང་དོང་། །ལོ་གྲངས་སྟོང་ཕྲག་ཉི་ཤུར་ཡང་། །ཁོ་མོས་རྒྱལ་བ་དེ་ལ་མཆོད་བཀུར་བྱས། །
en: {32} “For twenty thousand years I made offerings to the Jina.

source: རིན་ཆེན་བདུན་ཡང་ཡོན་དུ་ཕུལ། །རྒྱ་མཚོ་ཡོངས་དང་བཅས་པའི་ས་ཡང་གསོལ། །
en: I presented him with the seven jewels And the earth and its oceans.

source: མདོ་སྡེ་རྒྱ་མཚོ་ཡོན་ཏན་སྤྲིན། །སྨོན་ལམ་མཚོ་ལས་ཡོངས་སུ་བྱུང་བའི་རྒྱན། །ཀུན་ཀྱང་དེ་བཞིན་གཤེགས་ལས་བྱུང་། །བསམ་པ་ཇི་བཞིན་འགྲོ་བར་དེ་བཞིན་བསྟན། །
en: {33} “The clouds of the qualities of an ocean of sūtras, Which were a display arisen from an ocean of prayers, Had all appeared from the Tathāgata And were taught to beings according to their dispositions.

source: མཚན་མོའི་ལྷ་མོ་ཇི་སྙེད་ཅིག །དེ་ཚེ་སྙིང་བརྩེར་ཁོ་མོ་ཕན་བསྟན་པ། །
en: {34} “Those night goddesses, wishing to benefit me, With compassion woke me at that time.

source: དེ་འདྲར་གྱུར་ཏེ་མྱོས་བསལ་ཞེས། །ཁོ་མོ་མོས་པ་ཡོངས་སུ་སྐྱེས་པར་གྱུར། །
en: There arose an aspiration in me toward them: ‘May I become like them, awakening the intoxicated.’

source: ཁོ་མོའི་སྨོན་ལམ་དེ་འདྲའི་སེམས། །ཐོག་མ་བྱང་ཆུབ་མཆོག་ཏུ་སྐྱེས་པར་གྱུར། །འཁོར་བའི་རྒྱ་མཚོ་གནས་པའི་ཚེ། །སྲིད་པའི་རྒྱ་མཚོས་དེ་ནི་ཞིག་མ་གྱུར། །
en: {35} “That was the prayer that I made in my mind, My first development of the aspiration for the highest enlightenment, Which my residing in the ocean of saṃsāra, The ocean of existences, has not destroyed.

source: སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་རྣམས། །ཁོ་མོས་དད་པ་བསྐྱེད་དེ་མཆོད་པ་བྱས། །
en: {36} “I had faith in and offered to Ten million trillion buddhas.

source: འཁོར་བའི་ལྷ་དང་མི་དབུས་སུ། །ཡུལ་གྱི་དགའ་དང་བདེ་ལམ་མངོན་པར་སྨོན། །
en: While in the midst of saṃsāra’s devas and humans, I desired the scope of pleasure and bliss.

source: རྒྱལ་བའི་དང་པོ་དཔལ་གྱི་མཚོ། །
en: {37} “The first was Śrīsamudra.

source: དེ་ཡི་འོག་མ་ཡོན་ཏན་སྒྲོན་མ་སྟེ། །
en: After him came Guṇa­pradīpa.

source: རྒྱལ་བ་གསུམ་པ་རིན་ཆེན་དཔལ། །
en: The third was the Jina Ratnaketu.

source: སངས་རྒྱས་བཞི་པ་ནམ་མཁའི་ཤེས་རབ་བོ། །
en: The fourth was the Buddha Gagana­prajña.

source: རྒྱལ་བ་ལྔ་པ་མེ་ཏོག་མཆོག །
en: {38} “The fifth jina was Kusumagarbha.

source: རྒྱལ་བ་དྲུག་པ་ཆགས་མེད་ཟླ་བའི་བློ། །
en: The sixth jina was Asaṅga­mati­candra.

source: རྒྱལ་བ་བདུན་པ་འོད་རྒྱལ་ཆོས་ཀྱི་ཟླ། །
en: The seventh jina was Dharma­candra­prabhu­rāja.

source: བརྒྱད་པ་ཡེ་ཤེས་དཀྱིལ་འཁོར་སྣང་བའོ། །
en: The eighth was Jñāna­maṇḍala­prabhāsa.

source: རིན་ཆེན་འོད་འཕྲོ་རི་སྒྲོན་ཏེ། །རྒྱལ་བ་དགུ་པ་དེ་ཚེ་བྱུང་བར་གྱུར། །
en: {39} “Then came the time of the ninth jina, Racanārci­parvata­pradīpa.

source: བཅུ་པ་དུས་གསུམ་འོད་དབྱངས་ཏེ། །
en: The tenth was Tryadhva­prabha­ghoṣa.

source: དེ་དག་ཁོ་མོས་དད་པས་མཆོད། །
en: With faith, I made offerings to them all.

source: བཅུ་པོ་དེ་ལ་ས་སོགས་པ་དག །མི་ཡི་དབང་པོ་དམ་པ་ཀུན་མཆོད་དེ། །
en: {40} “I made offerings to those ten And all the other lords of humans.

source: ཚུལ་གྱི་རྒྱ་མཚོ་འདིར་ཞུགས་པའི། །མིག་ནི་དེ་སྲིད་ཡུན་གྱིས་ཐོབ་མ་གྱུར། །
en: But I did not at that time attain The vision of entering the ocean of ways.

source: དེ་འོག་ཞིང་གི་འཚམས་སྦྱོར་བ། །རིན་ཆེན་ཐམས་ཅད་འོད་ཅེས་བྱ་བ་བྱུང་། །བསྐལ་པ་ལྷ་ཡི་དཔལ་ཞེས་བྱ། །སངས་རྒྱས་ལྔ་བརྒྱ་དེ་ལ་བྱུང་བར་གྱུར། །
en: {41} “After that there followed the realm That was called Sarvaratnābha In the kalpa called Devaśrī, In which five hundred buddhas appeared.

source: ཐོག་མ་ཟླ་བའི་དཀྱིལ་འཁོར་བྱུང་། །
en: {42} “The first was Śaśimaṇḍala.

source: གཉིས་པ་ཉི་མའི་སྒྲོན་མ་མངོན་པར་སྐྱེས། །
en: The second born was Bhāskara­pradīpa.

source: སྣང་བའི་རྒྱལ་མཚན་སངས་རྒྱས་གསུམ། །དེ་ཡི་འོག་ཏུ་རིན་ཆེན་རི་བོའོ། །མེ་ཏོག་འོད་འཕྲོ་རྒྱ་མཚོ་སྒྲོན། །མེ་ཡི་དཔལ་དང་ལྷ་ཡི་དཔལ་གྱི་མཆོག །སྣང་བའི་རྒྱལ་པོ་འོད་ཀྱི་དཔལ། །
en: The third buddha was Jyotidhvaja, And after him there were Maṇisumeru, {43} “Kusumārci­sāgara­pradīpa, Jvalanaśrīśa, Devaśrīgarbha, Avabhāsa­rāja, and Prabha­ketu.

source: བཅུ་པ་ཡེ་ཤེས་ཀུན་སྣང་རྒྱལ་པོ་འོ། །
en: The tenth was Samanta­jñāna­prabha­rāja.

source: བཅུ་པོ་དེ་ལ་སྩོགས་པ་དག །མི་ཡི་དབང་པོ་དེ་དག་ཁོ་མོ་ཡིས། །
en: {44} “I made offerings to those ten And all the rest of those lords of humans.

source: ཕུང་པོའི་གནས་ལ་དད་དགའ་ཞིང་། །
en: But I delighted in being located in the body.

source: གནས་མེད་ཆོས་ལ་གནས་ཀྱི་བློ་མཆོད་དོ། །
en: I had a mind dwelling in the Dharma that has no location.

source: དེ་འོག་དེ་ཡི་མཚམས་སྦྱོར་བ། །འཇིག་རྟེན་ཁམས་བཟང་བྱུང་བར་གྱུར་པ་ནི། །པད་མའི་སྒྲོན་མ་སྤྲིན་གྱི་དཔལ། །དེ་ཚེ་བསྐལ་པ་ཚངས་པའི་འོད་ཅེས་བྱ། །
en: {45} “Following that, there was The beautiful world realm Called Dharma­pradīpa­megha­śrī In the kalpa called Brahmaprabha.

source: དེ་ལ་རྒྱལ་བ་ཚད་མེད་དེ། །
en: {46} “In that there were countless jinas.

source: དེ་དག་འཁོར་དང་བཅས་པ་ཁོ་མོས་མཆོད། །
en: I made offerings to them and their followers.

source: རྒྱལ་བ་དེ་དག་ཐམས་ཅད་ལས། །རིམ་གྲོ་ཆེན་པོས་ཁོ་མོས་ཆོས་ཀྱང་ཐོས། །
en: From all of those sugatas I heard the Dharma with great respect.

source: རྒྱལ་བའི་དང་པོ་རིན་ཆེན་རི། །
en: {47} “The first jina was Ratnameru.

source: དེ་ཡི་འོག་མ་ཡོན་ཏན་རྒྱ་མཚོ་སྟེ། །རྒྱལ་བ་ཆོས་དབྱིངས་དབྱངས་ཀྱི་དཔལ། །
en: After him were Guṇa­samudra And the Jina Dharma­dhātu­svara­ketu.

source: ཆོས་རབ་རྒྱ་མཚོ་སྒྲོག་པ་བཞི་པའོ། །
en: The fourth was Dharma­samudra­garjana.

source: ཆོས་ཀྱི་རྒྱལ་མཚན་གཟུངས་ཀྱི་འོད། །ཆོས་སྟོབས་འོད་དང་ནམ་མཁའི་བློ་གྲོས་ཏེ། །ཆོས་འོད་རི་བོས་སྤོ་མཐོན་དང་། །དེ་དག་ཐ་མའི་མཚན་ནི་སྤྲིན་དཔལ་ལོ། །
en: {48} “Then there were Dharmadhvaja, Dharaṇi­tejas, Dharma­bala­prabha, Gagana­buddhi, And Dharmārci­meru­śikha­rābha, And after them was Meghaśrī.

source: བཅུ་པོ་དེ་ལ་སོགས་པ་དག །མི་ཡི་དམ་པ་དེ་དག་ཀུན་མཆོད་དེ། །
en: {49} “I made offerings to those ten And all the rest of those lords of humans.

source: རྒྱལ་བའི་རྒྱ་མཚོ་འདིར་ཞུགས་པའི། །ཆོས་ཉིད་དེ་ནི་དག་མ་གྱུར། །
en: But I did not understand the true nature By which one enters the ocean of jinas.

source: དེ་ཡི་འོག་ཏུ་དེ་བཞིན་གཤེགས། །ཉི་མའི་སྒྲོན་མ་དཔལ་གྱི་དཔལ་ཞེས་བྱ། །ཞིང་ནི་སངས་རྒྱས་ཡོད་པ་སྟེ། །དེ་ལ་བསྐལ་པ་ཟླ་བའི་དཔལ་བྱུང་ངོ་། །
en: {50} “After that came the Sugata Sūrya­pradīpa­ketu­śrī In a realm called Buddhamati, In a kalpa called Somaśrī.

source: དེ་ལ་སྟོབས་བཅུ་བྱུང་བ་ནི། །བྱེ་བ་བརྒྱད་ཅུ་ཡོངས་སུ་ཚང་བ་སྟེ། །དེ་དག་ཀུན་ལའང་མཆོད་པའི་སྒོ། །རྒྱ་ཆེ་མཐའ་ཡས་ཡིད་འོང་དུ་མ་བྱས། །ཐོག་མར་བྱུང་བ་དྲི་ཟའི་རྒྱལ། །
en: {51} “I made offerings to all eight hundred million Of those with the ten strengths who were present there, With a variety of limitless, vast, Numerous beautiful offerings.

source: དེ་ཡི་འོག་ཏུ་སངས་རྒྱས་ཤིང་རྒྱལ་ཏེ། །རྒྱལ་བ་གསུམ་པ་ཡོན་ཏན་རི། །དེ་ཡི་འོག་ཏུ་རིན་ཆེན་སྤྱན་གཤེགས་སོ། །རྣམ་པར་སྣང་མཛད་འོད་ཀྱི་རྒྱན། །ཆོས་ཀྱི་རྒྱ་མཚོ་སངས་རྒྱས་གཟི་བརྗིད་དཔལ། །འཇིག་རྟེན་དབང་པོ་འོད་བཟང་དཔལ། །
en: {52} “The first after him was Gandharva­rāja, Second was the Buddha Druma­rāja, The third jina was Guṇa­sumeru, And after him were Ratnanetra, {53} “Vairocana­prabha­vyūha, Dharma­samudra, the Buddha Tejaśrī, Lokendra­teja­śrī­bhadra, And after them Sarva­dharma­prabha­rāja.

source: ཀུན་གྱི་ཐ་མ་ཆོས་འོད་རྒྱལ་པོའོ། །བཅུ་པོ་དེ་ལ་སྩོགས་པ་དག །བདེ་གཤེགས་དེ་དག་ཐམས་ཅད་མཆོད་བྱས་ཀྱང་། །
en: {54} “I made offerings to those ten And all the rest of those sugatas.

source: ཆོས་ཀྱི་རྒྱ་མཚོར་འཇུག་པ་ཡི། །ཡེ་ཤེས་ཁོ་མོས་ཐོབ་པར་མ་གྱུར་ཏོ། །
en: But I did not attain the knowledge That comprehended that ocean of Dharma.

source: དེ་ཡི་འོག་ཏུ་ཞིང་དག་པ། །རྡོ་རྗེའི་རང་བཞིན་མི་ཕྱེད་གཟི་བརྗིད་བརྟན། །ཀུན་ཏུ་འོད་སྤྲིན་མིང་ལྡན་བྱུང་། །རྒྱན་གཅིག་ཀུན་ནས་མཛེས་པར་གནས་པའོ། །
en: {55} “After that, there was a perfectly pure realm Called Vajra­māṇyabhedyadṛḍha­tejas, In which there were constant clouds of light And the presence of numerous beautiful displays.

source: དེ་ལ་སེམས་ཅན་དག་པ་མང་། །ཉོན་མོངས་དྲི་མས་ཉོན་མོངས་ཤིན་ཏུ་ཉུང་། །
en: {56} “Within it there were many pure beings With few afflictions from the stains of kleśas.

source: བསྐལ་པ་རབ་ཞི་བློ་གྲོས་འོད། །སངས་རྒྱས་སྟོང་རྣམས་བྱུང་བས་རྣམ་པར་བརྒྱན། །
en: The kalpa was called Praśānta­mati­tejas With the display of the appearance of a thousand buddhas.

source: རྒྱལ་བའི་དང་པོ་རྡོ་རྗེ་གཙུག །གཉིས་པ་ཆགས་མེད་སྟོབས་མངའི་མཚན་ལྡན་པ། །རྒྱལ་བ་ཆོས་ཉིད་གཟུགས་བརྙན་དང་། །ཕྱོགས་རྣམས་ཀུན་ཏུ་སྒྲོན་མ་གསལ་བའི་བདག །རྒྱལ་བ་ལྔ་པ་ཐུགས་རྗེའི་འོད། །
en: {57} “The first jina was Vajranābhi, The second was Asaṅga­bala­dhārin, Then there were the jinas Dharma­dhātu­pratibhāsa And Sarva­diśa­pradīpa­prabha­rāja.

source: རྒྱལ་བ་དྲུག་པ་བརྟུལ་ཞུགས་རྒྱ་མཚོའོ། །བདེ་གཤེགས་བཟོད་འཁོར་སྒྲོན་མ་དང་། །བརྒྱད་པ་ཆོས་ཀྱི་དཀྱིལ་འཁོར་སྣང་བ་སྟེ། །སྣང་བ་རྒྱ་མཚོས་བརྒྱན་པ་དང་། །དེ་དག་ཐ་མ་ཞི་བའི་རྒྱལ་པོའོ། །
en: {58} “The fifth jina was Karuṇatejas, The sixth jina was Vratasamudra, Then there was the Sugata Kṣānti­maṇḍala­pradīpa, And the eighth was Dharma­maṇḍala­prabhāsa; {59} “Then there was Avabhāsa­sāgara­vyūha, And after them was Praśānta­prabha­rāja.

source: བཅུ་པོ་དེ་ལ་སོགས་པ་དག །མི་ཡི་དམ་པ་དེ་ཀུན་ཁོ་མོས་མཆོད། །
en: I made offerings to those ten And all the rest of those lords of humans.

source: ཆོས་ཉིད་ནམ་མཁའ་མཉམ་པ་འདི། །རང་བཞིན་ཡོངས་སུ་ཀུན་ནས་དག་པ་སྟེ། །དེ་ལ་གནས་ཤིང་ཞིང་གི་རྣམས། །འབྱམ་ཀླས་ཀུན་ཏུ་སྤྱོད་སྤྱད་མ་དག་གོ །
en: {60} “But I did not realize this nature of phenomena, The pure nature that is the same as space, In which one should remain while practicing In the entire vast extent of realms.

source: དེ་ཡི་འོག་ཏུ་མདངས་དགའ་བའི། །ཞིང་གི་སྤོས་སྒྲོན་སྤྲིན་གྱི་དཔལ་ཞེས་བྱ། །ཀུན་ནས་ཉོན་མོངས་ཡོངས་སུ་དག །དེ་ཡི་བསྐལ་པ་ལེགས་པར་བྱུང་ཞེས་བྱ། །
en: {61} “After that, there was the beautiful realm Called Gandha­pradīpa­megha­śrī, Completely purified of all the kleśas, In the kalpa that was called Susaṃbhava.

source: རྒྱལ་བ་བྱེ་བ་དེ་ཚེ་བྱུང་། །དེ་དག་ཀུན་གྱི་དེ་ཚེའི་བསྐལ་པ་བརྒྱན། །
en: {62} “During that time there appeared ten million jinas Who were all arrayed throughout that kalpa.

source: མགོན་པོ་དེ་དག་ཆོས་གསུང་བ། །ཁོ་མོས་དྲན་པའི་སྟོབས་ཀྱིས་ཡོངས་སུ་བཟུང་། །རྒྱལ་བའི་དང་པོ་གྲགས་ཡངས་ཏེ། །
en: Those guides taught the Dharma, And I retained it through the power of memory.

source: ཆོས་ཀྱི་རྒྱ་མཚོ་ཤུགས་དྲག་དཔལ་གྱི་རྒྱལ། །ཆོས་དབང་རྒྱལ་པོ་ཡོན་ཏན་སྤྲིན། །ཆོས་ཀྱི་དཔལ་དང་ལྷ་ཡི་ཅོད་པན་ནོ། །ཡེ་ཤེས་འོད་འཕྲོ་གཟི་བརྗིད་དཔལ། །རྐང་གཉིས་དམ་པ་བདུན་པ་དེ་ཡིན་ནོ། །
en: {63} “The first jina was Vipulakīrti, Then there were Dharma­samudra­vega­śrī­rāja, Dharmendrarāja, Guṇa­ghoṣa, Dharmaśrī, and Devamakuṭa; {64} “Jñānārci­teja­śrī was the seventh Of those lords of two-legged beings.

source: རྒྱལ་བ་བརྒྱད་པ་ནམ་མཁའི་དབྱིངས། །དགུ་པ་ཀུན་ཏུ་འབྱུང་བའི་སྒྲོན་མ་སྟེ། །
en: The eighth jina was Gagana­ghoṣa, And the ninth was Samanta­saṃbhava­pradīpa.

source: དེ་དག་ཐ་མའི་སངས་རྒྱས་ནི། །མཛོད་སྤུའི་དཔལ་གྱི་འོད་ཀྱི་བློ་གྲོས་ཏེ། །རྒྱལ་བ་མི་མཆོག་དེ་དག་ལ། །
en: {65} “The buddha that came after them Was Ūrṇa­śrī­prabhāsa­mati.

source: མཆོད་པ་བྱས་ནས་ཆགས་མེད་དེ་མ་སྦྱངས། །
en: I made offerings to all those lords of humans, But I did not purify the path free of attachment.

source: དེ་ཡི་འོག་མ་རྒྱན་རབ་ཅན། །རིན་ཆེན་སྣ་ཚོགས་ཀུན་ཏུ་གནས་པ་སྟེ། །འཇིག་རྟེན་རྣམ་པར་ཕྱེ་བའི་མཐའ། །རིན་ཆེན་རྒྱལ་མཚན་བློ་གྲོས་མཆོག །
en: {66} “After that there was the well-arranged world realm Called Ratna­dhvajāgra­mati, Which was an excellent display Formed from all kinds of jewels.

source: དེ་ཚེའི་བསྐལ་པ་སྙིང་པོའི་ཚོགས། །དེ་ལ་སངས་རྒྱས་བརྒྱ་ཕྲག་ལྔ་བྱུང་སྟེ། །
en: {67} “During that kalpa, called Sārocaya, There appeared five hundred buddhas.

source: རྣམ་ཐར་ཆགས་མེད་འདི་འདོད་ཅིང་། །རང་བྱུང་དེ་དག་ཐམས་ཅད་ཁོ་མོས་མཆོད།
en: I made offerings to all those self-arisen ones, Wishing for this liberation free of attachment.

source: ཐོག་མའི་མཚན་ནི་ཡོན་ཏན་འཁོར། །ཞི་བའི་དབྱངས་དང་རྒྱ་མཚོ་ཕུན་སུམ་ཚོགས། །ཉི་མའི་གཟི་བརྗིད་དཔལ་གྱི་བདག །མཚན་གྱི་སྤྲིན་སྒྲ་དབྱངས་ཤེས་བྱ་བ་དང་། །ཆོས་དབྱངས་རྒྱལ་པོ་ཡོན་ཏན་བདག །བསོད་ནམས་རི་རབ་ཞི་བའི་འོད་ཀྱི་རྒྱལ། །
en: {68} “The first was named Guṇa­maṇḍala, Then there were Śānta­nirghoṣa, Sāgara­śrī, Āditya­tejas, Śrīrāja, Lakṣaṇa­meru, Megharutaghoṣa, {69} “Dharmendrarāja,Guṇa­rāja, Puṇya­sumeru, and Śānta­prabha­rāja.

source: བཅུ་པོ་དེ་ལ་སྩོགས་པ་དག །རྒྱལ་བ་དེ་དག་ཀུན་ཀྱང་ཁོ་མོས་མཆོད། །
en: I made offerings to those ten And all the rest of those jinas.

source: རྒྱལ་བའི་ལམ་ནི་དེར་སྦྱངས་ཏེ། །དེ་ལ་རྒྱལ་བ་ཀུན་ཀྱང་ཡང་དག་གཞོལ། །
en: {70} “All the jinas have followed The purifying path of the jinas.

source: འོན་ཀྱང་ད་དུང་རྒྱལ་བ་ཡི། །ཚུལ་འདིར་འཇུག་པའི་བཟོད་པ་མ་ཐོབ་བོ། །
en: However, I had still not attained The patience for entering this way of the jinas.

source: དེ་འོག་ཡིད་འོང་འོད་ལྡན་པ། །ཡོངས་སུ་དག་པའི་འཇིག་རྟེན་ཁམས་བྱུང་སྟེ། །ཞིང་དབྱངས་ཕྲེང་བའི་བློ་གྲོས་ཅན། །སེམས་ཅན་ཉོན་མོངས་ཉུང་བའི་གནས་ཡིན་ནོ། །
en: {71} “After that there was a completely pure World realm of very beautiful lights Called Śānta­nirghoṣa­hāra­mati, Where dwelled beings with few kleśas.

source: བསྐལ་པ་བདེ་ཞིང་མངོན་དགའ་སྟེ། །དེ་ལ་སངས་རྒྱས་བྱེ་བ་བརྒྱད་ཅུ་བྱུང་། །
en: {72} “In that kalpa called Sukhābhirati There appeared eight hundred million buddhas.

source: མི་མཆོག་དེ་ཀུན་ཁོ་མོས་མཆོད། །རྒྱལ་བ་མཆོག་གི་ལམ་ཡང་རྣམ་པར་སྦྱངས། །
en: I made offerings to all those lords of humans, Purifying the path of the supreme jinas.

source: རྒྱལ་བའི་དང་པོ་མེ་ཏོག་བརྩེགས། །རྒྱ་མཚོའ་སྙིང་པོ་ཡང་དག་འབྱུང་བའི་མཆོག །ལྷ་དབང་གཙུག་ཕུད་རིན་ཆེན་གཙོ། །གསེར་གྱི་རི་བོ་རིན་ཆེན་བརྩེགས་པ་དང་། །ཆོས་ཀྱི་རྒྱལ་མཚན་ནོར་གྱི་དཔལ། །
en: {73} “The first jina was Kusumarāśi, Then there were Sāgara­garbha, Saṃbhavagiri, Devendracūḍa, Maṇi­garbha, Kāñcanaparvata, Ratnaraśi, {74} “Dharmadhvaja, and Vacanaśrī, And after them there was Jñānamati.

source: དེ་དག་ཀུན་གྱི་ཐ་མ་ཡེ་ཤེས་བློ། །བཅུ་པོ་དེ་ལ་སོགས་པ་དག །ལྷ་དང་མི་གཙོ་དེ་དག་ཁོ་མོས་མཆོད། །
en: I made offerings to those ten And all the rest of those lords of devas and humans.

source: དེ་འོག་མཚམས་སྦྱོར་ཞིང་བྱུང་བ། །སྤྲུལ་པ་བཟང་པོའི་རྒྱལ་མཚན་སྒྲོན་མ་སྟེ། །བསྐལ་པ་སྟོང་གི་དཔལ་ཞེས་བྱ། །དེ་ལ་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་དྲུག །ཞི་བའི་རྒྱལ་མཚན་ཞི་གནས་དཔལ། །
en: {75} “After that, there was the realm Called Sunirmita­dhvaja­pradīpa, In the kalpa called Sahasraśrī, In which there were six quintillion buddhas.

source: ཞི་བའི་སྒྲོན་མ་སྤྲིན་གྱི་རྒྱལ་པོའི་དཔལ། །སྣང་བའི་འོད་ཀྱི་རྒྱལ་པོ་དང་། །རྣམ་པར་སྤྲིན་མཆེད་ཉི་མའི་གཟ་བརྗིད་དང་། །ཆོས་ཀྱི་སྒྲོན་མ་དཔལ་གྱི་རི། །འོད་འཕྲོའི་དཔལ་དང་ལྷ་ཡི་སྙིང་པོའི་དཔལ། །
en: {76} “There were Śānta­dhvaja, Śamathaketu, Śānta­pradīpa­megha­śrī­rāja, Avabhāsa­yanta­prabha­rājā, Meghavilambita, Suryatejas, {77} “Dharma­pradīpa­śrī, Mervarciśrī, And also Deva­śrī­garbha.

source: དེ་དག་ཐ་མར་བྱུང་བ་ནི། །སེང་གེའི་སྒྲ་སྒྲོགས་མཁས་པ་སྒྲོན་མའོ།
en: After all those there appeared Siṃha­vinardita Vidu­pradīpa.

source: བཅུ་པོ་དེ་ལ་སྩོགས་པ་དག །བདེ་གཤེགས་ཟླ་བ་དེ་དག་ཁོ་མོས་མཆོད། །འོན་ཀྱང་ཚུལ་མཚོ་འདིར་འཇུག་པའི། །བཟོད་པ་ཁོ་མོས་ཐོབ་པར་མ་གྱུར་ཏོ། །
en: {78} “I made offerings to those ten And all the rest of those sugata moons, But I did not attain the patience For entering this ocean of ways.

source: དེ་འོག་འཚམས་སྦྱོར་ཞིང་བྱུང་བ། །ཀུན་ཏུ་སྣང་བའི་དཔལ་ཞེས་བྱ་བ་སྟེ། །བསྐལ་པ་གནས་མེད་རྣམ་པར་བརྒྱན། །དེ་ལ་སངས་རྒྱས་བྱེ་བ་སུམ་ཅུ་དྲུག །
en: {79} “Following that there was the realm Called Samantābhaśrī, During the kalpa called Anālayavyūha, In which there were three hundred and sixty million buddhas.

source: དང་པོ་ཡོན་ཏན་ཀུན་ཏུ་སྤྲིན། །དེ་ཡི་འོག་མ་སངས་རྒྱས་ནམ་མཁའི་ཐུགས། །སངས་རྒྱས་ལེགས་བྱུང་རྣམ་བརྒྱན་དང་། །རྒྱ་མཚོ་ཆོས་ཀྱི་སྤྲིན་སྒྲ་སྒྲོགས་པའི་དབྱངས། །རྒྱལ་བ་ཆོས་དབྱིངས་གསུང་དབྱངས་དང་། །
en: {80} “The first was Samanta­guṇa­megha.
